bobcmartin/Microchip-Boards/boards.txt
menu.chip=Chip

##### BOARD NAMES #####

avrda.name=AVR128DA48 Curiosity Nano
avrdb.name=AVR128DB48 Curiosity Nano
avrdd.name=AVR64DD32 Curiosity Nano

#############################
# Default settings AVR-DA48 #
#############################

# Bootloading parameters and fuses
avrda.upload.tool=avrdude
avrda.upload.prog_interlock=
avrda.build.board=avrda
avrda.build.core=dxcore
avrda.build.text_section_start=.text=0x0
avrda.build.export_merged_output=false
avrda.build.mcupostfix=
avrda.build.printf=
avrda.build.printfabr=
avrda.build.attachabr=
avrda.build.wireabr=
avrda.build.appspmabr=.spm{bootloader.CODESIZE}

# Bootloading parameters and fuses 
avrda.bootloader.tool=avrdude
avrda.bootloader.WDTCFG=0x00
avrda.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrda.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda.bootloader.CODESIZE=0x00
avrda.bootloader.BOOTSIZE=0x01
avrda.bootloader.avrdudestring=
avrda.bootloader.pymcuprogstring=-aerase
avrda.bootloader.appspm=
avrda.bootloader.BOOTSIZE=0x00

# Chip (memory and pincount) 
avrda.menu.chip.128DA48=AVR128DA48
avrda.menu.chip.128DA48.build.mcu=avr128da48
avrda.menu.chip.128DA48.upload.maximum_size=131072
avrda.menu.chip.128DA48.upload.maximum_data_size=16384
avrda.menu.chip.128DA48.build.variant=48pin-standard

# Clock Speed + Source options
avrda.build.f_cpu=24000000L
avrda.build.speed=24

# BrownOut Detection (BOD) Options
avrda.bootloader.bodlevbits=000

# Retain EEPROM (EESAVE) 
avrda.bootloader.eesavebit=1

# Reset pin as GPIO option 
avrda.bootloader.resetpinbits=10

# Startup time options 
avrda.bootloader.SYSCFG1=0x04

################################
#  AVR-DB Settings             #
################################


# Parameters and defaults for DB parts 
avrdb.upload.tool=avrdude
avrdb.upload.prog_interlock=
avrdb.build.board=avrdb
avrdb.build.core=dxcore
avrdb.build.f_cpu={build.speed}000000L
avrdb.build.text_section_start=.text=0x0
avrdb.build.extra_flags= {bootloader.appspm}
avrdb.build.export_merged_output=false
avrdb.build.mcupostfix=
avrdb.build.printf=
avrdb.build.wireabr=

# Bootloading parameters and fuses       
avrdb.bootloader.tool=avrdude
avrdb.bootloader.WDTCFG=0x00
avrdb.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdb.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdb.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
#avrdb.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
avrdb.bootloader.CODESIZE=0x00
avrdb.bootloader.BOOTSIZE=0x01
avrdb.bootloader.avrdudestring=
avrdb.bootloader.pymcuprogstring=-aerase

##########################################
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
##########################################

avrdb.build.mcupostfix=
avrdb.build.printfabr=
avrdb.build.attachabr=
avrdb.build.wireabr=
avrdb.build.appspmabr=.spm{bootloader.CODESIZE}


# AVR-DB submenu options                     

# Chip (memory and pincount)             
avrdb.menu.chip.avr128db48=AVR128DB48
avrdb.menu.chip.avr128db48.build.mcu=avr128db48
avrdb.menu.chip.avr128db48.upload.maximum_size=131072
avrdb.menu.chip.avr128db48.upload.maximum_data_size=16384
avrdb.menu.chip.avr128db48.build.variant=48pin-standard


# Clock Speed + Source options
avrdb.build.f_cpu=24000000L
avrdb.build.speed=24
avrdb.build.clocksource=0

# BrownOut Detection (BOD) Options
avrdb.bootloader.bodlevbits=000


# Retain EEPROM (EESAVE)                 
avrdb.bootloader.eesavebit=1

# Reset pin as GPIO option             
avrdb.bootloader.resetpinbits=10

# attachInterrupt Mode                   
avrdb.build.attachmode=-DCORE_ATTACH_ALL


# MVIO menu                              
avrdb.bootloader.mviobits=01


# Startup time options  
# Default set to 8 ms                 
avrdb.bootloader.sutbits=100

# SPM            
avrdb.bootloader.appspm=
avrdb.bootloader.BOOTSIZE=0x00

############################
# Extra options menu setup #
############################
menu.extras=Options

# 128DA48 options

##### 1x Wire, No Float #####
avrda.menu.extras.extra1=1 Wire, Printf float none
avrda.menu.extras.extra1.build.wire.mode=MORS_SINGLE
avrda.menu.extras.extra1.build.wireabr=.wO

##### 2x Wire, No Float #####
avrda.menu.extras.extra2=2 Wire, Printf float none
avrda.menu.extras.extra2.build.wire.mode=MORS_BOTH
avrda.menu.extras.extra2.build.wireabr=.wO2

##### 1x Wire, Minimal Float #####
avrda.menu.extras.extra3=1 Wire, Printf float min
avrda.menu.extras.extra3.build.wire.mode=MORS_SINGLE
avrda.menu.extras.extra3.build.wireabr=.wO
avrda.menu.extras.extra3.build.printf=-Wl,-u,vfprintf -lprintf_min
avrda.menu.extras.extra3.build.printfabr=.pfM

##### 2x Wire, Minimal Float #####
avrda.menu.extras.extra4=2 Wire, Printf float min
avrda.menu.extras.extra4.build.wire.mode=MORS_BOTH
avrda.menu.extras.extra4.build.wireabr=.wO2
avrda.menu.extras.extra4.build.printf=-Wl,-u,vfprintf -lprintf_min
avrda.menu.extras.extra4.build.printfabr=.pfM


##### 1x Wire, Full Float #####
avrda.menu.extras.extra5=1 Wire, Printf float full
avrda.menu.extras.extra5.build.wire.mode=MORS_SINGLE
avrda.menu.extras.extra5.build.wireabr=.wO
avrda.menu.extras.extra5.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrda.menu.extras.extra5.build.printfabr=.pfF

##### 2x Wire, Full Float #####
avrda.menu.extras.extra6=2 Wire, Printf float full
avrda.menu.extras.extra6.build.wire.mode=MORS_BOTH
avrda.menu.extras.extra6.build.wireabr=.wO2
avrda.menu.extras.extra6.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrda.menu.extras.extra6.build.printfabr=.pfF

##### DB48 extra options menu setup #####

##### 1x Wire, No Float #####
avrdb.menu.extras.extra1=1 Wire, Printf float none
avrdb.menu.extras.extra1.build.wire.mode=MORS_SINGLE
avrdb.menu.extras.extra1.build.wireabr=.wO

##### 2x Wire, No Float #####
avrdb.menu.extras.extra2=2 Wire, Printf float none
avrdb.menu.extras.extra2.build.wire.mode=MORS_BOTH
avrdb.menu.extras.extra2.build.wireabr=.wO2

##### 1x Wire, Minimal Float #####
avrdb.menu.extras.extra3=1 Wire, Printf float min
avrdb.menu.extras.extra3.build.wire.mode=MORS_SINGLE
avrdb.menu.extras.extra3.build.wireabr=.wO
avrdb.menu.extras.extra3.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdb.menu.extras.extra3.build.printfabr=.pfM

##### 2x Wire, Minimal Float #####
avrdb.menu.extras.extra4=2 Wire, Printf float min
avrdb.menu.extras.extra4.build.wire.mode=MORS_BOTH
avrdb.menu.extras.extra4.build.wireabr=.wO2
avrdb.menu.extras.extra4.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdb.menu.extras.extra4.build.printfabr=.pfM

##### 1x Wire, Full Float #####
avrdb.menu.extras.extra5=1x Wire, Printf float full
avrdb.menu.extras.extra5.build.wire.mode=MORS_SINGLE
avrdb.menu.extras.extra5.build.wireabr=.wO
avrdb.menu.extras.extra5.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdb.menu.extras.extra5.build.printfabr=.pfF

##### 2x Wire, Full Float #####
avrdb.menu.extras.extra6=2x Wire, Printf float full 
avrdb.menu.extras.extra6.build.wire.mode=MORS_BOTH
avrdb.menu.extras.extra6.build.wireabr=.wO2
avrdb.menu.extras.extra6.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdb.menu.extras.extra6.build.printfabr=.pfF


##### 64DD32 extra options menu setup #####

##### 1x Wire, No Float #####
avrdd.menu.extras.extra1=1 Wire, Printf float none
avrdd.menu.extras.extra1.build.wire.mode=MORS_SINGLE
avrdd.menu.extras.extra1.build.wireabr=.wO

##### 2x Wire, No Float #####
avrdd.menu.extras.extra2=2 Wire, Printf float none
avrdd.menu.extras.extra2.build.wire.mode=MORS_BOTH
avrdd.menu.extras.extra2.build.wireabr=.wO2

##### 1x Wire, Minimal Float #####
avrdd.menu.extras.extra3=1 Wire, Printf float min
avrdd.menu.extras.extra3.build.wire.mode=MORS_SINGLE
avrdd.menu.extras.extra3.build.wireabr=.wO
avrdd.menu.extras.extra3.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdd.menu.extras.extra3.build.printfabr=.pfM

##### 2x Wire, Minimal Float #####
avrdd.menu.extras.extra4=2 Wire, Printf float min
avrdd.menu.extras.extra4.build.wire.mode=MORS_BOTH
avrdd.menu.extras.extra4.build.wireabr=.wO2
avrdd.menu.extras.extra4.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdd.menu.extras.extra4.build.printfabr=.pfM

##### 1x Wire, Full Float #####
avrdd.menu.extras.extra5=1x Wire, Printf float full
avrdd.menu.extras.extra5.build.wire.mode=MORS_SINGLE
avrdd.menu.extras.extra5.build.wireabr=.wO
avrdd.menu.extras.extra5.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdd.menu.extras.extra5.build.printfabr=.pfF

##### 2x Wire, Full Float #####
avrdd.menu.extras.extra6=2x Wire, Printf float full 
avrdd.menu.extras.extra6.build.wire.mode=MORS_BOTH
avrdd.menu.extras.extra6.build.wireabr=.wO2
avrdd.menu.extras.extra6.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdd.menu.extras.extra6.build.printfabr=.pfF

# -------- AVR DD ----------------#

avrdd.build.board=avrdd
avrdd.build.MVIOenable=-DMVIO_ENABLED
avrdd.build.core=dxcore
avrdb.build.speed=24
avrdb.build.clocksource=0
avrdd.build.f_cpu=24000000L
avrdd.build.text_section_start=.text=0x200
avrdd.build.extra_flags= -DSERIAL_PORT_BOOT={bootloader.portname} -DSERIAL_PORT_BOOT_PORTMUX={bootloader.portswap} -DUSING_OPTIBOOT {build.mvioenable>}
avrdd.build.export_merged_output=false
avrdd.build.highestcb=B2


#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrdd.bootloader.tool=avrdude
avrdd.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}{bootloader.port}{bootloader.timeout}.hex
avrdd.bootloader.WDTCFG=0x00
avrdd.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdd.bootloader.SYSCFG0=0b110{bootloader.resetpinbits}000
avrdd.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
avrdd.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
avrdd.bootloader.CODESIZE=0x00
avrdd.bootloader.BOOTSIZE=0x01
avrdd.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
avrdd.bootloader.pymcuprogstring=-f{bootloader.file} -a write

#----------------------------------------#
# Upload parameters for Optiboot         #
#________________________________________#
avrdd.upload.tool=avrdude
avrdd.upload.protocol=arduino
avrdd.upload.extra_params=-D
avrdd.upload.speed=115200
avrdd.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
#avrddopti.build.mcupostfix=opti
#avrddopti.build.printfabr=
#avrddopti.build.attachabr=
#avrddopti.build.wireabr=
#avrddopti.build.appspmabr=

#avrddopti.menu.chip.avr64dd32=AVR64DD32
#avrddopti.menu.chip.avr64dd32.build.mcu=avr64dd32
#avrddopti.menu.chip.avr64dd32.bootloader.class=optiboot_dd64
#avrddopti.menu.chip.avr64dd32.upload.maximum_size=65024
#avrddopti.menu.chip.avr64dd32.upload.maximum_data_size=8192
#avrddopti.menu.chip.avr64dd32.build.variant=32in-ddseries
